# 請同學計算x1的最大值
x1.max <- local({
  # 請填寫你的程式碼
})


# 請同學計算x1的最小值
x1.min <- local({
  # 請填寫你的程式碼
})

# 請同學計算x1的全距
x1.range <- local({
  # 請填寫你的程式碼
})

# 請同學計算x2的最大值
x2.max <- local({
  # 請填寫你的程式碼
})


# 請同學計算x2的最小值
x2.min <- local({
  # 請填寫你的程式碼
})

# 請同學計算x2的全距
x2.range <- local({
  # 請填寫你的程式碼
})

# 請同學計算x3的最大值
x3.max <- local({
  # 請填寫你的程式碼
})


# 請同學計算x3的最小值
x3.min <- local({
  # 請填寫你的程式碼
})

# 請同學計算x3的全距
x3.range <- local({
  # 請填寫你的程式碼
})

# 請同學計算x4的最大值
x4.max <- local({
  # 請填寫你的程式碼
})


# 請同學計算x4的最小值
x4.min <- local({
  # 請填寫你的程式碼
})

# 請同學計算x4的全距
x4.range <- local({
  # 請填寫你的程式碼
})

# 請同學存檔後回到console輸入`submit()`檢查答案
